import { declensionOfNumber } from './declensionOfNumber';

describe('Тест функции declensionOfNumber', () => {
  test.each`
    number | titles                                     | expected
    ${1}   | ${['документ', 'документа', 'документов']} | ${'документ'}
    ${21}  | ${['документ', 'документа', 'документов']} | ${'документ'}
    ${2}   | ${['документ', 'документа', 'документов']} | ${'документа'}
    ${22}  | ${['документ', 'документа', 'документов']} | ${'документа'}
    ${5}   | ${['документ', 'документа', 'документов']} | ${'документов'}
    ${25}  | ${['документ', 'документа', 'документов']} | ${'документов'}
    ${11}  | ${['документ', 'документа', 'документов']} | ${'документов'}
    ${101} | ${['документ', 'документа', 'документов']} | ${'документ'}
  `(
    'Должно возвращать $expected для $number $titles',
    ({ number, titles, expected }) => {
      expect(declensionOfNumber(number, titles)).toEqual(expected);
    },
  );
});
